//*****************************************************************************************  
&НаСервере
Функция ПолучитьТекстМакета(Наименование)

	Возврат ПолучитьОбщийМакет(Наименование).ПолучитьТекст();

КонецФункции
//*****************************************************************************************  
&НаСервере
Функция ПолучитьОформлениеКода()
	
	Соответствие = Новый Соответствие; 
	
	#Область Черные
	
	Соответствие.Вставить("~", "<span class='black'>~</span>");
	Соответствие.Вставить("""", "<span class='black'>""""</span>");
	Соответствие.Вставить("""""""", "<span class='black'>""""""""</span>");
	
	#КонецОбласти
	
	#Область Красные
	
	Соответствие.Вставить("==", "<span class='red'>=</span>");
	Соответствие.Вставить("&gt", "<span class='red'>&gt</span>");
	Соответствие.Вставить("&lt", "<span class='red'>&lt</span>");
	Соответствие.Вставить("&gt==", "<span class='red'>&gt=</span>");
	Соответствие.Вставить("&lt==", "<span class='red'>&lt=</span>");
	Соответствие.Вставить("&lt&gt", "<span class='red'>&lt&gt</span>");
	Соответствие.Вставить("Истина", "<span class='red'>Истина</span>");
	Соответствие.Вставить("И", "<span class='red'>И</span>");
	Соответствие.Вставить("КонецЕсли", "<span class='red'>КонецЕсли</span>");
	Соответствие.Вставить("Если", "<span class='red'>Если</span>");
	Соответствие.Вставить("Тогда", "<span class='red'>Тогда</span>");
	Соответствие.Вставить("Функция", "<span class='red'>Функция</span>");
	Соответствие.Вставить("КонецФункции", "<span class='red'>КонецФункции</span>");
	Соответствие.Вставить("Процедура", "<span class='red'>Процедура</span>");
	Соответствие.Вставить("КонецПроцедуры", "<span class='red'>КонецПроцедуры</span>");
	Соответствие.Вставить("Цикл", "<span class='red'>Цикл</span>");
	Соответствие.Вставить("По", "<span class='red'>По</span>");
	Соответствие.Вставить("Для", "<span class='red'>Для</span>");
	Соответствие.Вставить("Каждого", "<span class='red'>Каждого</span>");
	Соответствие.Вставить("Из", "<span class='red'>Из</span>");
	Соответствие.Вставить("Пока", "<span class='red'>Пока</span>");
	Соответствие.Вставить("Перейти", "<span class='red'>Перейти</span>");
	Соответствие.Вставить("Новый", "<span class='red'>Новый</span>");
	Соответствие.Вставить("Ложь", "<span class='red'>Ложь</span>");
	Соответствие.Вставить("Иначе", "<span class='red'>Иначе</span>");
	Соответствие.Вставить("КонецЕсли;", "<span class='red'>КонецЕсли;</span>");
	Соответствие.Вставить("КонецЦикла", "<span class='red'>КонецЦикла</span>");
	Соответствие.Вставить("КонецЦикла;", "<span class='red'>КонецЦикла;</span>");
	Соответствие.Вставить("НЕ", "<span class='red'>НЕ</span>");
	Соответствие.Вставить("ИЛИ", "<span class='red'>ИЛИ</span>");
	Соответствие.Вставить("Символ", "<span class='red'>Символ</span>");
	Соответствие.Вставить("Число", "<span class='red'>Число</span>");
	Соответствие.Вставить("Сред", "<span class='red'>Сред</span>");
	Соответствие.Вставить("Сред", "<span class='red'>Сред</span>");
	Соответствие.Вставить("Возврат", "<span class='red'>Возврат</span>");
	Соответствие.Вставить("Неопределено", "<span class='red'>Неопределено</span>");
	Соответствие.Вставить("Попытка", "<span class='red'>Попытка</span>");
	Соответствие.Вставить("Исключение", "<span class='red'>Исключение</span>");
	Соответствие.Вставить("КонецПопытки", "<span class='red'>КонецПопытки</span>");
	
	#КонецОбласти                     
	
	Возврат Соответствие;

КонецФункции
//*****************************************************************************************  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Количество = 0;
	//
	//Табуляция = "&nbsp;&nbsp;&nbsp;&nbsp;";
	//
	//Оформление = ПолучитьОформлениеКода();  
	//
	//Текст = "";
	//
	//Для А = 1 По СтрЧислоСтрок(Параметры.text) Цикл
	//	
	//	Строка = СокрЛП(СтрПолучитьСтроку(Параметры.text, А));
	//	
	//	Строка = СтрЗаменить(Строка, "=", "=="); 
	//	Строка = СтрЗаменить(Строка, ">", "&gt"); 
	//	Строка = СтрЗаменить(Строка, "<", "&lt");             
	//	
	//	Строка = СтрЗаменить(Строка, "/", "<span class='red'>/</span>"); 
	//	
	//	Массив = СтрРазделить(Строка, " ");
	//	
	//	НоваяСтрока = "";
	//	
	//	Для Каждого Слово Из Массив Цикл   
	//		
	//		Замена = Оформление.Получить(Слово);
	//		
	//		Если Замена <> Неопределено Тогда 
	//			
	//			Слово = СтрЗаменить(Слово, Слово, Замена); 
	//			
	//		КонецЕсли; 
	//		
	//		Слово = СтрЗаменить(Слово, ";", "<span class='red'>;</span>"); 
	//		Слово = СтрЗаменить(Слово, ",", "<span class='red'>,</span>"); 
	//		Слово = СтрЗаменить(Слово, ".", "<span class='red'>.</span>"); 
	//		Слово = СтрЗаменить(Слово, "(", "<span class='red'>(</span>"); 
	//		Слово = СтрЗаменить(Слово, ")", "<span class='red'>)</span>"); 
	//		Слово = СтрЗаменить(Слово, "[", "<span class='red'>[</span>"); 
	//		Слово = СтрЗаменить(Слово, "]", "<span class='red'>]</span>"); 
	//		Слово = СтрЗаменить(Слово, "+", "<span class='red'>+</span>"); 
	//		Слово = СтрЗаменить(Слово, "-", "<span class='red'>-</span>"); 
	//		Слово = СтрЗаменить(Слово, "*", "<span class='red'>*</span>"); 
	//		
	//		НоваяСтрока = НоваяСтрока + Слово + " ";
	//		
	//	КонецЦикла;  
	//	
	//	Таб = ""; 
	//	
	//	Закрывать = Истина;

	//	Если СтрНайти(НоваяСтрока, "КонецФункции") > 0
	//		ИЛИ СтрНайти(НоваяСтрока, "КонецПроцедуры") > 0
	//		ИЛИ СтрНайти(НоваяСтрока, "Функция") > 0
	//		ИЛИ СтрНайти(НоваяСтрока, "Процедура") > 0 Тогда

	//		Закрывать = Ложь;
	//		
	//		Количество = 0;
	//
	//	ИначеЕсли (СтрНайти(НоваяСтрока, "Если") > 0 И СтрНайти(НоваяСтрока, "Тогда") > 0)
	//		ИЛИ (СтрНайти(НоваяСтрока, "Пока") > 0 И СтрНайти(НоваяСтрока, "Цикл") > 0)
	//		ИЛИ (СтрНайти(НоваяСтрока, "Для") > 0 И СтрНайти(НоваяСтрока, "Цикл") > 0)
	//		ИЛИ СтрНайти(НоваяСтрока, "Попытка") > 0 Тогда

	//		Закрывать = Ложь;

	//	ИначеЕсли СтрНайти(НоваяСтрока, "КонецЕсли") > 0
	//		ИЛИ (СтрНайти(НоваяСтрока, "КонецЦикла") > 0)
	//		ИЛИ (СтрНайти(НоваяСтрока, "Исключение") > 0)
	//		ИЛИ (СтрНайти(НоваяСтрока, "КонецПопытки") > 0) Тогда
	//		
	//		Закрывать = Истина;
	//		
	//		Количество = Количество - 1;

	//	КонецЕсли;			
	//	
	//	Для Б = 1 По Количество Цикл  
	//		
	//		Таб = Таб + Табуляция;
	//		
	//	КонецЦикла;   
	//	
	//	Если Прав(СокрЛП(НоваяСтрока), 1) = ":" Тогда 
	//		
	//		Закрывать = Ложь;
	//
	//	КонецЕсли;
	//	
	//	Текст = Текст + Таб + СокрЛП(НоваяСтрока) + ?(Закрывать, "<span class='red'>;</span>", "") + "</br>";

	//	Если (СтрНайти(НоваяСтрока, "Если") > 0 И СтрНайти(НоваяСтрока, "Тогда") > 0)
	//		ИЛИ (СтрНайти(НоваяСтрока, "Пока") > 0 И СтрНайти(НоваяСтрока, "Цикл") > 0)
	//		ИЛИ СтрНайти(НоваяСтрока, "Попытка") > 0 ИЛИ СтрНайти(НоваяСтрока, "Исключение") > 0 Тогда

	//		Количество = Количество + 1;

	//	КонецЕсли;			
	//	
	//	Если СтрНайти(НоваяСтрока, "Функция") > 0
	//		ИЛИ СтрНайти(НоваяСтрока, "Процедура") > 0 Тогда

	//		Количество = Количество + 1;

	//	КонецЕсли;	

	//КонецЦикла;     
	
	HTML = ПолучитьТекстМакета("HTML");
	
	HTML = СтрЗаменить(HTML, "%codemirror_css%", ПолучитьТекстМакета("codemirror_css"));
	HTML = СтрЗаменить(HTML, "%foldgutter_css%", ПолучитьТекстМакета("foldgutter_css"));
	HTML = СтрЗаменить(HTML, "%codemirror_js%", ПолучитьТекстМакета("codemirror_js"));
	HTML = СтрЗаменить(HTML, "%onecfold_js%", ПолучитьТекстМакета("onecfold_js"));
	HTML = СтрЗаменить(HTML, "%foldcode_js%", ПолучитьТекстМакета("foldcode_js"));
	HTML = СтрЗаменить(HTML, "%foldgutter_js%", ПолучитьТекстМакета("foldgutter_js"));
	HTML = СтрЗаменить(HTML, "%onec_js%", ПолучитьТекстМакета("onec_js"));
	HTML = СтрЗаменить(HTML, "%onec_css%", ПолучитьТекстМакета("onec_css"));
	HTML = СтрЗаменить(HTML, "%TEXT%", Параметры.text);
	
КонецПроцедуры
//*****************************************************************************************  
