//*****************************************************************************************  
&НаСервере
Функция ПолучитьТекстМакета(Наименование)

	Возврат ПолучитьОбщийМакет(Наименование).ПолучитьТекст();

КонецФункции
//*****************************************************************************************  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Текст = "";
	
	Для А = 1 По СтрЧислоСтрок(Параметры.text) Цикл
		
		НоваяСтрока = СокрЛП(СтрПолучитьСтроку(Параметры.text, А));

		Закрывать = Истина;

		Если СтрНайти(НоваяСтрока, "КонецФункции") > 0
			ИЛИ СтрНайти(НоваяСтрока, "КонецПроцедуры") > 0
			ИЛИ СтрНайти(НоваяСтрока, "Функция") > 0
			ИЛИ СтрНайти(НоваяСтрока, "Процедура") > 0 Тогда

			Закрывать = Ложь;

		ИначеЕсли (СтрНайти(НоваяСтрока, "Если") > 0 И СтрНайти(НоваяСтрока, "Тогда") > 0)
			ИЛИ (СтрНайти(НоваяСтрока, "Пока") > 0 И СтрНайти(НоваяСтрока, "Цикл") > 0)
			ИЛИ (СтрНайти(НоваяСтрока, "Для") > 0 И СтрНайти(НоваяСтрока, "Цикл") > 0)
			ИЛИ СтрНайти(НоваяСтрока, "Попытка") > 0 Тогда

			Закрывать = Ложь;

		ИначеЕсли СтрНайти(НоваяСтрока, "КонецЕсли") > 0
			ИЛИ (СтрНайти(НоваяСтрока, "КонецЦикла") > 0)
			ИЛИ (СтрНайти(НоваяСтрока, "Исключение") > 0)
			ИЛИ (СтрНайти(НоваяСтрока, "КонецПопытки") > 0) Тогда
			
			Закрывать = Истина;

		КонецЕсли;			

		Если Прав(СокрЛП(НоваяСтрока), 1) = ":" Тогда 
			
			Закрывать = Ложь;
	
		КонецЕсли;
		
		Текст = Текст + СокрЛП(НоваяСтрока) + ?(Закрывать, ";", "") + Символы.ПС;

	КонецЦикла;     
	
	HTML = ПолучитьТекстМакета("HTML");
	
	HTML = СтрЗаменить(HTML, "%codemirror_css%", ПолучитьТекстМакета("codemirror_css"));
	HTML = СтрЗаменить(HTML, "%foldgutter_css%", ПолучитьТекстМакета("foldgutter_css"));
	HTML = СтрЗаменить(HTML, "%codemirror_js%", ПолучитьТекстМакета("codemirror_js"));
	HTML = СтрЗаменить(HTML, "%onecfold_js%", ПолучитьТекстМакета("onecfold_js"));
	HTML = СтрЗаменить(HTML, "%foldcode_js%", ПолучитьТекстМакета("foldcode_js"));
	HTML = СтрЗаменить(HTML, "%foldgutter_js%", ПолучитьТекстМакета("foldgutter_js"));
	HTML = СтрЗаменить(HTML, "%onec_js%", ПолучитьТекстМакета("onec_js"));
	HTML = СтрЗаменить(HTML, "%onec_css%", ПолучитьТекстМакета("onec_css"));
	HTML = СтрЗаменить(HTML, "%TEXT%", Текст);

КонецПроцедуры
//*****************************************************************************************  
