//*****************************************************************************************
Функция ЕстьЗначениеВПамяти(Наименование, Тип) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Наименование ПОДОБНО &Наименование
	|	И Memory.Тип = &Тип");
	
	Запрос.УстановитьПараметр("Тип",			 Тип);
	Запрос.УстановитьПараметр("Наименование",	 Наименование);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
//*****************************************************************************************
Функция ЭтоЗначениеВПамяти(Адрес) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Адрес);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
//*****************************************************************************************
Функция ЭтоЗначениеВСтекеВременныхПеременных(Адрес) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	StackTMP.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.StackTMP КАК StackTMP
	|ГДЕ
	|	StackTMP.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Адрес);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
//***************************************************************************************** 
Функция ПолучитьАдрес(opCode, operand)  
	
	Если opCode = 2 ИЛИ opCode = 4 Тогда 
		
		Если opCode = 2 Тогда 
			
			Тип = Перечисления.ТипЗначенияПамяти.ГлобальнаяПеременная;
			
		ИначеЕсли opCode = 3 Тогда 
			
			Тип = Перечисления.ТипЗначенияПамяти.ЛокальнаяПеременная;
			
		ИначеЕсли opCode = 4 Тогда 
			
			Тип = Перечисления.ТипЗначенияПамяти.Константа;
			
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Memory.Адрес КАК Адрес
		|ИЗ
		|	РегистрСведений.Memory КАК Memory
		|ГДЕ
		|	Memory.Строка = &Строка
		|	И Memory.Тип = &Тип");
		
		Запрос.УстановитьПараметр("Тип",	 Тип);
		Запрос.УстановитьПараметр("Строка",	 operand);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			
			Возврат Выборка.Адрес;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции
//***************************************************************************************** 
Процедура УстановитьЗначениеПамяти(Данные, Значение) Экспорт
	
	Если ЭтоЗначениеВПамяти(Данные.Адрес) Тогда 
		
		Memory = РегистрыСведений.Memory.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Memory, Данные);
		
		Memory.Значение = Новый ХранилищеЗначения(Значение); 
		
		Memory.Записать(Истина);  
		
	ИначеЕсли ЭтоЗначениеВСтекеВременныхПеременных(Данные.Адрес) Тогда 
		
		StackTMP = РегистрыСведений.StackTMP.СоздатьМенеджерЗаписи();    
		
		StackTMP.Тип			 = Данные.Тип; 
		StackTMP.Адрес			 = Данные.Адрес; 
		StackTMP.Отладка		 = Данные.Отладка;
		StackTMP.Наименование	 = Данные.Наименование; 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	StackTMP.Строка КАК Строка
		|ИЗ
		|	РегистрСведений.StackTMP КАК StackTMP
		|ГДЕ
		|	StackTMP.Адрес = &Адрес");
		
		Запрос.УстановитьПараметр("Адрес", Данные.Адрес);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			
			StackTMP.Строка = Выборка.Строка; 
			
		КонецЕсли;
		
		//ЗаполнитьЗначенияСвойств(StackTMP, Данные);
		
		StackTMP.Значение = Новый ХранилищеЗначения(Значение); 
		
		StackTMP.Записать(Истина);  
		
	КонецЕсли;
	
КонецПроцедуры
//*****************************************************************************************
Процедура УстановитьЗначениеПамятиПоНаименованию(Наименование, Значение, Тип) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Адрес КАК Адрес,
	|	Memory.Строка КАК Строка,
	|	Memory.Тип КАК Тип,
	|	Memory.Значение КАК Значение,
	|	Memory.Наименование КАК Наименование,
	|	Memory.Отладка КАК Отладка
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Наименование = &Наименование
	|	И Memory.Тип = &Тип");
	
	Запрос.УстановитьПараметр("Тип",			 Тип);
	Запрос.УстановитьПараметр("Наименование",	 Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Memory = РегистрыСведений.Memory.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Memory, Выборка);
		
		Memory.Строка = 0;
		
		Memory.Значение = Новый ХранилищеЗначения(Значение); 
		
		Memory.Записать(Истина);
		
	Иначе
		
		ВызватьИсключение "Не найдено значение - " + Наименование + " в памяти"; 
		
	КонецЕсли;
	
КонецПроцедуры
//*****************************************************************************************
Функция ПолучитьЗначениеНастроек(Тип) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Значения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Значения КАК Значения
	|ГДЕ
	|	Значения.Тип = &Тип");
	
	Запрос.УстановитьПараметр("Тип", Тип);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Выборка.Значение.Получить();
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции
//*****************************************************************************************
Процедура УстановитьЗначениеНастроек(Проект, Файл, Тип, Значение) Экспорт 
	
	Значения = РегистрыСведений.Значения.СоздатьМенеджерЗаписи();
	
	Значения.Тип		 = Тип;
	Значения.Файл		 = Файл;
	Значения.Проект		 = Проект;
	Значения.Значение	 = Новый ХранилищеЗначения(Значение);
	
	Значения.Записать(Истина);
	
КонецПроцедуры
//*****************************************************************************************
Функция ПолучитьОпКоды() 
	
	OpCode = Новый Соответствие;
	
	OpCode.Вставить(0, Новый Структура("Мнемоника, Описание", "Nop", "Нет операции"));
	OpCode.Вставить(1, Новый Структура("Мнемоника, Описание", "LineNum", "Начало строки кода"));
	OpCode.Вставить(2, Новый Структура("Мнемоника, Описание", "LdVar", "Загрузить в стек глобальную переменную"));
	OpCode.Вставить(3, Новый Структура("Мнемоника, Описание", "LdLoc", "Загрузить в стек локальную переменную"));
	OpCode.Вставить(4, Новый Структура("Мнемоника, Описание", "LdConst", "Загрузить в стек константное значение"));
	OpCode.Вставить(5, Новый Структура("Мнемоника, Описание", "LdRet", "Загрузить на стек результат последней функции/метода"));
	OpCode.Вставить(6, Новый Структура("Мнемоника, Описание", "LdFalse", "Загрузить на стек Ложь"));
	OpCode.Вставить(7, Новый Структура("Мнемоника, Описание", "LdTrue", "Загрузить на стек Истина"));
	OpCode.Вставить(8, Новый Структура("Мнемоника, Описание", "LdUndef", "Загрузить на стек Неопределено"));
	OpCode.Вставить(9, Новый Структура("Мнемоника, Описание", "LdNull", "Загрузить на стек Null"));
	OpCode.Вставить(10, Новый Структура("Мнемоника, Описание", "LdNone", "Загрузить на стек пустое значение"));
	OpCode.Вставить(11, Новый Структура("Мнемоника, Описание", "unknown1", "unknown1"));
	OpCode.Вставить(12, Новый Структура("Мнемоника, Описание", "LdProp", "Получение свойства .<Имя Свойства>"));
	OpCode.Вставить(13, Новый Структура("Мнемоника, Описание", "LdIndex", "Получение элемента массива []"));
	OpCode.Вставить(14, Новый Структура("Мнемоника, Описание", "Iter", "Получить из коллекции выборку"));
	OpCode.Вставить(15, Новый Структура("Мнемоника, Описание", "Next", "Получить из выборки очередной элемент коллекции. Этот элемент попадает в переменную, которая была на вершине стека, а в стек вместо этой переменной помещается результат успешности (Истина - получили очередной элемент, Ложь - нет)"));
	OpCode.Вставить(16, Новый Структура("Мнемоника, Описание", "Assign", "="));
	OpCode.Вставить(17, Новый Структура("Мнемоника, Описание", "Ret", "Возврат (установить результат функции/метода)"));
	OpCode.Вставить(18, Новый Структура("Мнемоника, Описание", "ArgNum", "Указание количества используемых параметров в следующем вызове (метода, функции)"));
	OpCode.Вставить(19, Новый Структура("Мнемоника, Описание", "CallLoc", "Вызов локальной процедуры или функции"));
	OpCode.Вставить(20, Новый Структура("Мнемоника, Описание", "CallProc", "Выполнение метода .<Имя метода>() (являющегося процедурой, т.е. без возврата значения)"));
	OpCode.Вставить(21, Новый Структура("Мнемоника, Описание", "CallFunc", "Выполнение метода .<Имя метода>() (являющегося функцией, т.е. возвращающий значение)"));
	OpCode.Вставить(22, Новый Структура("Мнемоника, Описание", "End", "Конец блока (процедуры, модуля)"));
	OpCode.Вставить(23, Новый Структура("Мнемоника, Описание", "Minus", "*(-1)"));
	OpCode.Вставить(24, Новый Структура("Мнемоника, Описание", "Add", "+"));
	OpCode.Вставить(25, Новый Структура("Мнемоника, Описание", "Sub", "-"));
	OpCode.Вставить(26, Новый Структура("Мнемоника, Описание", "Mul", "*"));
	OpCode.Вставить(27, Новый Структура("Мнемоника, Описание", "Div", "/"));
	OpCode.Вставить(28, Новый Структура("Мнемоника, Описание", "Mod", "%"));
	OpCode.Вставить(29, Новый Структура("Мнемоника, Описание", "Not", "НЕ"));
	OpCode.Вставить(30, Новый Структура("Мнемоника, Описание", "And", "И"));
	OpCode.Вставить(31, Новый Структура("Мнемоника, Описание", "Or", "ИЛИ"));
	OpCode.Вставить(32, Новый Структура("Мнемоника, Описание", "unknown2", "unknown2"));
	OpCode.Вставить(33, Новый Структура("Мнемоника, Описание", "Cmp", "=="));
	OpCode.Вставить(34, Новый Структура("Мнемоника, Описание", "Ne", "<>"));
	OpCode.Вставить(35, Новый Структура("Мнемоника, Описание", "Gt", ">"));
	OpCode.Вставить(36, Новый Структура("Мнемоника, Описание", "Lt", "<"));
	OpCode.Вставить(37, Новый Структура("Мнемоника, Описание", "Gte", ">="));
	OpCode.Вставить(38, Новый Структура("Мнемоника, Описание", "Lte", "<="));
	OpCode.Вставить(39, Новый Структура("Мнемоника, Описание", "Jmp", "Переход на заданный шаг"));
	OpCode.Вставить(40, Новый Структура("Мнемоника, Описание", "JmpFalse", "Переход, если Ложь"));
	OpCode.Вставить(41, Новый Структура("Мнемоника, Описание", "JmpTrue", "Переход, если Истина"));
	OpCode.Вставить(42, Новый Структура("Мнемоника, Описание", "Goto", "Перейти Lbl"));
	OpCode.Вставить(43, Новый Структура("Мнемоника, Описание", "Inc", "Инкремент"));
	OpCode.Вставить(44, Новый Структура("Мнемоника, Описание", "BeginTry", "Попытка"));
	OpCode.Вставить(45, Новый Структура("Мнемоника, Описание", "BlckEnd", "Завершение блока (Процедура, Функция, Попытка) без ошибки (Возврат или Исключение)"));
	OpCode.Вставить(46, Новый Структура("Мнемоника, Описание", "EndTry", "КонецПопытки (конец обработки ошибки)"));
	OpCode.Вставить(47, Новый Структура("Мнемоника, Описание", "Raise", "ВызватьИсключение"));
	OpCode.Вставить(48, Новый Структура("Мнемоника, Описание", "PutTmp", "Создать на стеке временных переменных временную переменную"));
	OpCode.Вставить(49, Новый Структура("Мнемоника, Описание", "LdTmp", "Загрузить в стек временную переменную из стека временных переменных"));
	OpCode.Вставить(50, Новый Структура("Мнемоника, Описание", "PopTmp", "Удалить из стека временных переменных временную переменную"));
	OpCode.Вставить(51, Новый Структура("Мнемоника, Описание", "New", "Новый"));
	OpCode.Вставить(52, Новый Структура("Мнемоника, Описание", "Exec", "Выполнить"));
	OpCode.Вставить(53, Новый Структура("Мнемоника, Описание", "СтрДлина", "СтрДлина"));
	OpCode.Вставить(54, Новый Структура("Мнемоника, Описание", "СокрЛ", "СокрЛ"));
	OpCode.Вставить(55, Новый Структура("Мнемоника, Описание", "СокрП", "СокрП"));
	OpCode.Вставить(56, Новый Структура("Мнемоника, Описание", "СокрЛП", "СокрЛП"));
	OpCode.Вставить(57, Новый Структура("Мнемоника, Описание", "Лев", "Лев"));
	OpCode.Вставить(58, Новый Структура("Мнемоника, Описание", "Прав", "Прав"));
	OpCode.Вставить(59, Новый Структура("Мнемоника, Описание", "Сред", "Сред"));
	OpCode.Вставить(60, Новый Структура("Мнемоника, Описание", "Найти", "Найти"));
	OpCode.Вставить(61, Новый Структура("Мнемоника, Описание", "Врег", "Врег"));
	OpCode.Вставить(62, Новый Структура("Мнемоника, Описание", "Нрег", "Нрег"));
	OpCode.Вставить(63, Новый Структура("Мнемоника, Описание", "Символ", "Символ"));
	OpCode.Вставить(64, Новый Структура("Мнемоника, Описание", "КодСимвола", "КодСимвола"));
	OpCode.Вставить(65, Новый Структура("Мнемоника, Описание", "ПустаяСтрока", "ПустаяСтрока"));
	OpCode.Вставить(66, Новый Структура("Мнемоника, Описание", "Цел", "Цел"));
	OpCode.Вставить(67, Новый Структура("Мнемоника, Описание", "Окр", "Окр"));
	OpCode.Вставить(68, Новый Структура("Мнемоника, Описание", "Окр", "Окр"));
	OpCode.Вставить(69, Новый Структура("Мнемоника, Описание", "Булево", "Булево"));
	OpCode.Вставить(70, Новый Структура("Мнемоника, Описание", "Число", "Число"));
	OpCode.Вставить(71, Новый Структура("Мнемоника, Описание", "Строка", "Строка"));
	OpCode.Вставить(72, Новый Структура("Мнемоника, Описание", "Дата", "Дата"));
	OpCode.Вставить(73, Новый Структура("Мнемоника, Описание", "Дата", "Дата"));
	OpCode.Вставить(74, Новый Структура("Мнемоника, Описание", "Дата", "Дата"));
	OpCode.Вставить(75, Новый Структура("Мнемоника, Описание", "ДобавитьМесяц", "ДобавитьМесяц"));
	OpCode.Вставить(76, Новый Структура("Мнемоника, Описание", "НачалоМесяца", "НачалоМесяца"));
	OpCode.Вставить(77, Новый Структура("Мнемоника, Описание", "КонецМесяца", "КонецМесяца"));
	OpCode.Вставить(78, Новый Структура("Мнемоника, Описание", "НачалоКвартала", "НачалоКвартала"));
	OpCode.Вставить(79, Новый Структура("Мнемоника, Описание", "КонецКвартала", "КонецКвартала"));
	OpCode.Вставить(80, Новый Структура("Мнемоника, Описание", "НачалоГода", "НачалоГода"));
	OpCode.Вставить(81, Новый Структура("Мнемоника, Описание", "КонецГода", "КонецГода"));
	OpCode.Вставить(82, Новый Структура("Мнемоника, Описание", "Год", "Год"));
	OpCode.Вставить(83, Новый Структура("Мнемоника, Описание", "Месяц", "Месяц"));
	OpCode.Вставить(84, Новый Структура("Мнемоника, Описание", "День", "День"));
	OpCode.Вставить(85, Новый Структура("Мнемоника, Описание", "Час", "Час"));
	OpCode.Вставить(86, Новый Структура("Мнемоника, Описание", "Минута", "Минута"));
	OpCode.Вставить(87, Новый Структура("Мнемоника, Описание", "Секунда", "Секунда"));
	OpCode.Вставить(88, Новый Структура("Мнемоника, Описание", "ДеньГода", "ДеньГода"));
	OpCode.Вставить(89, Новый Структура("Мнемоника, Описание", "НеделяГода", "НеделяГода"));
	OpCode.Вставить(90, Новый Структура("Мнемоника, Описание", "ДеньНедели", "ДеньНедели"));
	OpCode.Вставить(91, Новый Структура("Мнемоника, Описание", "НачалоНедели", "НачалоНедели"));
	OpCode.Вставить(92, Новый Структура("Мнемоника, Описание", "КонецНедели", "КонецНедели"));
	OpCode.Вставить(93, Новый Структура("Мнемоника, Описание", "НачалоДня", "НачалоДня"));
	OpCode.Вставить(94, Новый Структура("Мнемоника, Описание", "КонецДня", "КонецДня"));
	OpCode.Вставить(95, Новый Структура("Мнемоника, Описание", "НачалоЧаса", "НачалоЧаса"));
	OpCode.Вставить(96, Новый Структура("Мнемоника, Описание", "КонецЧаса", "КонецЧаса"));
	OpCode.Вставить(97, Новый Структура("Мнемоника, Описание", "НачалоМинуты", "НачалоМинуты"));
	OpCode.Вставить(98, Новый Структура("Мнемоника, Описание", "КонецМинуты", "КонецМинуты"));
	OpCode.Вставить(99, Новый Структура("Мнемоника, Описание", "ТекущаяДата", "ТекущаяДата"));
	OpCode.Вставить(100, Новый Структура("Мнемоника, Описание", "СтрЗаменить", "СтрЗаменить"));
	OpCode.Вставить(101, Новый Структура("Мнемоника, Описание", "СтрЧислоСтрок", "СтрЧислоСтрок"));
	OpCode.Вставить(102, Новый Структура("Мнемоника, Описание", "СтрПолучитьСтроку", "СтрПолучитьСтроку"));
	OpCode.Вставить(103, Новый Структура("Мнемоника, Описание", "Мин", "Мин"));
	OpCode.Вставить(104, Новый Структура("Мнемоника, Описание", "Макс", "Макс"));
	OpCode.Вставить(105, Новый Структура("Мнемоника, Описание", "СтрЧислоВхождений", "СтрЧислоВхождений"));
	OpCode.Вставить(106, Новый Структура("Мнемоника, Описание", "ОписаниеОшибки", "ОписаниеОшибки"));
	OpCode.Вставить(107, Новый Структура("Мнемоника, Описание", "ТипЗнч", "ТипЗнч"));
	OpCode.Вставить(108, Новый Структура("Мнемоника, Описание", "Тип", "Тип"));
	OpCode.Вставить(109, Новый Структура("Мнемоника, Описание", "Вычислить", "Вычислить"));
	OpCode.Вставить(110, Новый Структура("Мнемоника, Описание", "Формат", "Формат"));
	OpCode.Вставить(111, Новый Структура("Мнемоника, Описание", "Новый", "Новый"));
	OpCode.Вставить(112, Новый Структура("Мнемоника, Описание", "ACos", "ACos"));
	OpCode.Вставить(113, Новый Структура("Мнемоника, Описание", "ASin", "ASin"));
	OpCode.Вставить(114, Новый Структура("Мнемоника, Описание", "ATan", "ATan"));
	OpCode.Вставить(115, Новый Структура("Мнемоника, Описание", "Cos", "Cos"));
	OpCode.Вставить(116, Новый Структура("Мнемоника, Описание", "Exp", "Exp"));
	OpCode.Вставить(117, Новый Структура("Мнемоника, Описание", "Log", "Log"));
	OpCode.Вставить(118, Новый Структура("Мнемоника, Описание", "Log10", "Log10"));
	OpCode.Вставить(119, Новый Структура("Мнемоника, Описание", "Pow", "Pow"));
	OpCode.Вставить(120, Новый Структура("Мнемоника, Описание", "Sin", "Sin"));
	OpCode.Вставить(121, Новый Структура("Мнемоника, Описание", "Sqrt", "Sqrt"));
	OpCode.Вставить(122, Новый Структура("Мнемоника, Описание", "Tan", "Tan"));
	OpCode.Вставить(123, Новый Структура("Мнемоника, Описание", "ДобавитьОбработчик", "ДобавитьОбработчик"));
	OpCode.Вставить(124, Новый Структура("Мнемоника, Описание", "ДобавитьОбработчик", "ДобавитьОбработчик"));
	OpCode.Вставить(125, Новый Структура("Мнемоника, Описание", "УдалитьОбработчик", "УдалитьОбработчик"));
	OpCode.Вставить(126, Новый Структура("Мнемоника, Описание", "УдалитьОбработчик", "УдалитьОбработчик"));
	OpCode.Вставить(127, Новый Структура("Мнемоника, Описание", "ТРег", "ТРег"));
	OpCode.Вставить(128, Новый Структура("Мнемоника, Описание", "ИнформацияОбОшибке", "ИнформацияОбОшибке"));
	
	Возврат OpCode;
	
КонецФункции
//*****************************************************************************************
Процедура ДобавитьВСтек(Адрес = Неопределено, Значение = Неопределено, Наименование = Неопределено, Тип = Неопределено, ВР = Ложь, УДС = Ложь, Шаг = 0)
	
	Stack = РегистрыСведений.Stack.СоздатьМенеджерЗаписи(); 
	
	Если ВР Тогда 
		
		ЗаполнитьЗначенияСвойств(Stack, Значение);
		
		Stack.Строка = ПолучитьРазмерСтека() + 1;	
		
	ИначеЕсли УДС Тогда 
		
		Stack.Адрес			 = Адрес;
		Stack.АдресУДС		 = Адрес;
		Stack.Строка		 = ПолучитьРазмерСтека() + 1;	
		
	Иначе   
		
		Stack.Тип			 = ?(Тип = Неопределено, Перечисления.ТипЗначенияПамяти.ВременнаяПеременная, Тип);
		Stack.Адрес			 = ?(Адрес = Неопределено, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"), Адрес);
		Stack.Строка		 = ПолучитьРазмерСтека() + 1;	
		Stack.Значение		 = Новый ХранилищеЗначения(Значение);	
		Stack.Наименование	 = ?(Наименование = Неопределено, Неопределено, Наименование);	
		
	КонецЕсли; 
	
	Stack.Шаг = Шаг;
	
	Stack.Записать(Истина); 
	
КонецПроцедуры
//*****************************************************************************************
Процедура ДобавитьВСтекTMP(Адрес = Неопределено, Значение = Неопределено, Наименование = Неопределено)
	
	StackTMP = РегистрыСведений.StackTMP.СоздатьМенеджерЗаписи();
	
	StackTMP.Тип			 = Перечисления.ТипЗначенияПамяти.ВременнаяПеременная;
	StackTMP.Адрес			 = ?(Адрес = Неопределено, Новый УникальныйИдентификатор(), Адрес);
	StackTMP.Строка			 = ПолучитьРазмерСтекаTMP() + 1;	
	StackTMP.Значение		 = Новый ХранилищеЗначения(Значение);	
	StackTMP.Наименование	 = ?(Наименование = Неопределено, Неопределено, Наименование);	
	
	StackTMP.Записать(Истина);
	
КонецПроцедуры
//*****************************************************************************************
Функция ПолучитьЗначениеПамятиПоАдресу(Адрес, ДальниеПеременные = Неопределено) 
	
	Если ДальниеПеременные = Неопределено Тогда 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Memory.Адрес КАК Адрес,
		|	Memory.Наименование КАК Наименование,
		|	Memory.Значение КАК Значение,
		|	Memory.Отладка КАК Отладка,
		|	Memory.Тип КАК Тип,
		|	Memory.Строка КАК Строка
		|ИЗ
		|	РегистрСведений.Memory КАК Memory
		|ГДЕ
		|	Memory.Адрес = &Адрес");
		
		Запрос.УстановитьПараметр("Адрес", Адрес);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			
			Отладка = Выборка.Отладка.Получить();
			
			Возврат Новый Структура("Адрес, Наименование, Значение, Отладка, Тип, Строка", 
			Выборка.Адрес, 
			Выборка.Наименование, 
			?(ЗначениеЗаполнено(Отладка), Отладка, Выборка.Значение.Получить()),
			Выборка.Отладка,
			Выборка.Тип,
			Выборка.Строка
			);
			
		Иначе 
			
			ВызватьИсключение "Не найдено значение в памяти по адресу - " + Строка(Адрес); 
			
		КонецЕсли; 
		
	Иначе 
		
		Возврат Новый Структура("Адрес, Наименование, Значение, Отладка, Тип, Строка", Адрес, "", ДальниеПеременные.Получить(Адрес), "", "", "");
		
	КонецЕсли;
	
КонецФункции
//*****************************************************************************************
Функция ПолучитьРазмерСтека()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Stack.Адрес) КАК Количество
	|ИЗ
	|	РегистрСведений.Stack КАК Stack");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Количество;
		
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции
//*****************************************************************************************
Функция ПолучитьРазмерСтекаTMP()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(StackTMP.Адрес) КАК Количество
	|ИЗ
	|	РегистрСведений.StackTMP КАК StackTMP");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Количество;
		
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции
//*****************************************************************************************
Функция ПолучитьЗначениеСтекаПоИндексу(Индекс)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Stack.Адрес КАК Адрес,
	|	Stack.Строка КАК Строка,
	|	Stack.АдресУДС КАК АдресУДС,
	|	Stack.Значение КАК Значение,
	|	Stack.Отладка КАК Отладка,
	|	Stack.Наименование КАК Наименование,
	|	Stack.Тип КАК Тип
	|ИЗ
	|	РегистрСведений.Stack КАК Stack
	|ГДЕ
	|	Stack.Строка = &Строка");
	
	Запрос.УстановитьПараметр("Строка", Индекс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Новый Структура("Строка, Адрес, АдресУДС, Значение, Отладка, Наименование, Тип", Выборка.Строка, Выборка.Адрес, Выборка.АдресУДС, Выборка.Значение, Выборка.Отладка, Выборка.Наименование, Выборка.Тип);		
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
//*****************************************************************************************
Функция ПолучитьЗначениеСтекаTMPПоИндексу(Индекс)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	StackTMP.Адрес КАК Адрес,
	|	StackTMP.Строка КАК Строка,
	|	StackTMP.Значение КАК Значение,
	|	StackTMP.Отладка КАК Отладка,
	|	StackTMP.Наименование КАК Наименование,
	|	StackTMP.Тип КАК Тип
	|ИЗ
	|	РегистрСведений.StackTMP КАК StackTMP
	|ГДЕ
	|	StackTMP.Строка = &Строка");
	
	Запрос.УстановитьПараметр("Строка", Индекс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Новый Структура("Строка, Адрес, Значение, Отладка, Наименование, Тип", Выборка.Строка, Выборка.Адрес, Выборка.Значение, Выборка.Отладка, Выборка.Наименование, Выборка.Тип);		
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
//***************************************************************************************** 
Процедура УдалитьЗначениеСтека(Индекс)
	
	Stack = РегистрыСведений.Stack.СоздатьНаборЗаписей();
	
	Stack.Отбор.Строка.Установить(Индекс);
	
	Stack.Записать();
	
КонецПроцедуры
//***************************************************************************************** 
Процедура УдалитьЗначениеСтекаTMP(Индекс)
	
	StackTMP = РегистрыСведений.StackTMP.СоздатьНаборЗаписей();
	
	StackTMP.Отбор.Строка.Установить(Индекс);
	
	StackTMP.Записать();
	
КонецПроцедуры
//***************************************************************************************** 
Функция ПолучитьCode(Шаг)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Code.opCode КАК opCode,
	|	Code.Operand КАК Operand,
	|	Code.Адрес КАК Адрес
	|ИЗ
	|	РегистрСведений.Code КАК Code
	|ГДЕ
	|	Code.Строка = &Строка
	|	И НЕ Code.break");
	
	Запрос.УстановитьПараметр("Строка", Шаг);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат Новый Структура("opCode, Operand, Адрес", Выборка.opCode, Выборка.Operand, Выборка.Адрес);		
		
	КонецЦикла;
	
	Возврат Неопределено;	
	
КонецФункции
//*****************************************************************************************
Функция ПолучитьЗначениеПоТипу(Проект, Файл, Тип, ЗначениеВозврата = "") Экспорт 
	
	Значение = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Значения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Значения КАК Значения
	|ГДЕ
	|	Значения.Тип = &Тип
	|	И Значения.Проект = &Проект
	|	И Значения.Файл = &Файл");
	
	Запрос.УстановитьПараметр("Тип",	 Тип);
	Запрос.УстановитьПараметр("Файл",	 Файл);
	Запрос.УстановитьПараметр("Проект",	 Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Выборка.Значение.Получить();
		
	КонецЕсли; 
	
	Возврат ЗначениеВозврата;
	
КонецФункции
//*****************************************************************************************
Процедура ТекстМодуля(Проект, Файл, ОпКод, Операнд) Экспорт 
	
	Текст = ПолучитьЗначениеПоТипу(Проект, Файл, Перечисления.Значение.CodeText, "");
	
	УстановитьЗначениеНастроек(Проект, Файл, Перечисления.Значение.CodeText, Текст + "{" + СтрЗаменить(Строка(ОпКод), Символы.НПП, "") + "," + СтрЗаменить(Строка(Операнд), Символы.НПП, "") + "}," + Символы.ПС);
	
КонецПроцедуры
//*****************************************************************************************
Функция ПолучитьАдресМетки(Номер, Тип)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Labels.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Labels КАК Labels
	|ГДЕ
	|	Labels.Строка = &Строка
	|	И Labels.Тип = &Тип");
	
	Запрос.УстановитьПараметр("Тип",	 Тип);
	Запрос.УстановитьПараметр("Строка",	 Номер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат	Выборка.Значение;
		
	КонецЕсли;;
	
	ВызватьИсключение "Метки с номером - " + Номер + ", не найдена";	
	
КонецФункции
//*****************************************************************************************
Функция ПолучитьЗначениеКонстантыПоНомеру(Номер)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Строка = &Строка
	|	И Memory.Тип = &Тип");
	
	Запрос.УстановитьПараметр("Тип",	 Перечисления.ТипЗначенияПамяти.Константа);
	Запрос.УстановитьПараметр("Строка",	 Номер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат	Выборка.Значение.Получить();
		
	КонецЕсли;;
	
	ВызватьИсключение "Константа с номером - " + Номер + ", не найдена";	
	
КонецФункции
//*****************************************************************************************
Функция ПолучитьРазмерИстории()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	History.Ном КАК Ном,
	|	History.Строка КАК Строка,
	|	History.opCode КАК opCode,
	|	History.Operand КАК Operand,
	|	History.Описание КАК Описание,
	|	History.Наименование КАК Наименование,
	|	History.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.History КАК History");
	
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции
//*****************************************************************************************
Процедура ЗаписатьИсторию(Строка, ОпКод, Операнд)
	
	Коды = ПолучитьОпКоды();
	
	History = РегистрыСведений.History.СоздатьМенеджерЗаписи(); 
	
	History.Ном				 = ПолучитьРазмерИстории() + 1;	
	History.Строка			 = Строка;	
	History.opCode			 = ОпКод;	
	History.Operand			 = Операнд;	
	History.Описание		 = Коды.Получить(ОпКод).Описание;	
	History.Идентификатор	 = Новый УникальныйИдентификатор();	
	
	History.Записать();
	
КонецПроцедуры
//*****************************************************************************************
Функция ВыполнитьШагОбработки(Проект, Файл) Экспорт 
	
	ДальниеПеременные = Новый Соответствие;
	
	Шаг = ПолучитьЗначениеНастроек(Перечисления.Значение.CurrentPoin); 
	
	Если Шаг = -1 Тогда 
		
		Шаг = ПолучитьЗначениеНастроек(Перечисления.Значение.EntryPoint) + 1; 
		
		Константы.ТекущаяСтрока.Установить(1);
		
		ТекстМодуля(Проект, Файл, 1, Константы.ТекущаяСтрока.Получить());
		
		Константы.ТекущаяСтрока.Установить(Константы.ТекущаяСтрока.Получить() + 1);
		
	КонецЕсли;
	
	Результат = Истина;
	
	Пока Результат Цикл 
		
		РезультатВыполнения = ВыполнитьШаг(Проект, Файл, Шаг, ДальниеПеременные);
		
		Если РезультатВыполнения.Результат Тогда  
			
			Результат = РезультатВыполнения.Результат;
			
			УстановитьЗначениеНастроек(Проект, Файл, Перечисления.Значение.CurrentPoin, РезультатВыполнения.Шаг);
			
			Шаг = РезультатВыполнения.Шаг;
			
		Иначе
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;    
	
КонецФункции
//*****************************************************************************************
Функция ВыполнитьОдинШагОбработки(Проект, Файл) Экспорт 
	
	ДальниеПеременные = Новый Соответствие;
	
	Шаг = ПолучитьЗначениеНастроек(Перечисления.Значение.CurrentPoin); 
	
	Если Шаг = -1 Тогда 
		
		Шаг = ПолучитьЗначениеНастроек(Перечисления.Значение.EntryPoint) + 1; 
		
		Константы.ТекущаяСтрока.Установить(1);
		
		ТекстМодуля(Проект, Файл, 1, Константы.ТекущаяСтрока.Получить());  
		
		Константы.ТекущаяСтрока.Установить(Константы.ТекущаяСтрока.Получить() + 1);    
		
	КонецЕсли;
	
	РезультатВыполнения = ВыполнитьШаг(Проект, Файл, Шаг, ДальниеПеременные);
	
	Если РезультатВыполнения.Результат Тогда  
		
		УстановитьЗначениеНастроек(Проект, Файл, Перечисления.Значение.CurrentPoin, РезультатВыполнения.Шаг);	
		
	КонецЕсли;
	
	Возврат РезультатВыполнения.Результат;    
	
КонецФункции
//*****************************************************************************************   
Функция ВыполнитьШаг(Проект, Файл, Шаг, ДальниеПеременные) Экспорт
	
	НачатьТранзакцию();
	
	Строка = ПолучитьCode(Шаг);
	
	ОпКод	 = Строка.opCode;
	Операнд	 = Строка.Operand;  
	
	Если ОпКод <> 6 
		И ОпКод <> 7 
		И ОпКод <> 39 
		И ОпКод <> 40 
		И ОпКод <> 41 
		И ОпКод <> 42 
		Тогда 
		
		ТекстМодуля(Проект, Файл, ОпКод, Операнд);
		
	КонецЕсли;	
	
	ЗаписатьИсторию(Шаг, ОпКод, Операнд);
	
	Если ОпКод = 0 Тогда // "Нет операции"
	ИначеЕсли ОпКод = 1 Тогда // "Начало строки кода"
	ИначеЕсли ОпКод = 2 Тогда // "Загрузить в стек глобальную переменную"  
		
		ЗначениеПамяти = ПолучитьЗначениеПамятиПоАдресу(Строка.Адрес);
		
		ДобавитьВСтек(ЗначениеПамяти.Адрес, ЗначениеПамяти.Значение, ЗначениеПамяти.Наименование, ЗначениеПамяти.Тип,,, Шаг);  
		
	ИначеЕсли ОпКод = 3 Тогда // "Загрузить в стек локальную переменную"
		
		//ДобавитьВСтек(Данные["values"][ТочкиРазделов.Получить("Proc")]["values"][PROC[PROC.Количество() - 1]]["values"]["values"][Операнд]["Адрес"]);
		
	ИначеЕсли ОпКод = 4 Тогда // "Загрузить в стек константное значение"  
		
		ЗначениеПамяти = ПолучитьЗначениеПамятиПоАдресу(Строка.Адрес);
		
		ДобавитьВСтек(ЗначениеПамяти.Адрес, ЗначениеПамяти.Значение, ЗначениеПамяти.Наименование, ЗначениеПамяти.Тип,,, Шаг);  
		
	ИначеЕсли ОпКод = 5 Тогда // "Загрузить на стек результат последней функции/метода"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УстановитьЗначениеПамяти(ЗначениеСтекаВ, 1);
		
	ИначеЕсли ОпКод = 6 Тогда // "Загрузить на стек Ложь" 
		
		ДобавитьВСтек(, Ложь,,,,, Шаг);
		
	ИначеЕсли ОпКод = 7 Тогда // "Загрузить на стек Истина"
		
		ДобавитьВСтек(, Истина,,,,, Шаг);
		
	ИначеЕсли ОпКод = 8 Тогда // "Загрузить на стек Неопределено"
		
		ДобавитьВСтек(, Неопределено,,,,, Шаг);
		
	ИначеЕсли ОпКод = 9 Тогда // "Загрузить на стек Null"
		
		ДобавитьВСтек(, Null,,,,, Шаг);
		
	ИначеЕсли ОпКод = 10 Тогда // "Загрузить на стек пустое значение"
		
		ДобавитьВСтек(, "");
		
	ИначеЕсли ОпКод = 11 Тогда // "unknown1"
	ИначеЕсли ОпКод = 12 Тогда // "Получение свойства .<Имя Свойства>"
		
		Object = ПолучитьЗначениеСтекаПоИндексу(ПолучитьРазмерСтека()).Значение.Получить();
		
		НаименованиеСвойства = ПолучитьЗначениеКонстантыПоНомеру(Операнд + 1);   
		//НаименованиеСвойства = ПолучитьЗначениеКонстантыПоНомеру(Операнд);   
		
		УдалитьЗначениеСтека(ПолучитьРазмерСтека());  
		
		Адрес = Новый УникальныйИдентификатор();
		
		ДальниеПеременные.Вставить(Адрес, Object[НаименованиеСвойства]);
		
		ДобавитьВСтек(Адрес, Адрес,,,, Истина, Шаг);
		
	ИначеЕсли ОпКод = 13 Тогда // "Получение элемента массива []" 
		
		Индекс = ПолучитьЗначениеСтекаПоИндексу(ПолучитьРазмерСтека()).Значение.Получить();	
		
		УдалитьЗначениеСтека(ПолучитьРазмерСтека());
		
		Массив = ПолучитьЗначениеСтекаПоИндексу(ПолучитьРазмерСтека()).Значение.Получить();
		
		УдалитьЗначениеСтека(ПолучитьРазмерСтека());
		
		ДобавитьВСтек(, Массив[Индекс],,,,, Шаг); 
		
	ИначеЕсли ОпКод = 14 Тогда // "Получить из коллекции выборку"
	ИначеЕсли ОпКод = 15 Тогда // "Получить из выборки очередной элемент коллекции. Этот элемент попадает в переменную, которая была на вершине стека, а в стек вместо этой переменной помещается результат успешности (Истина - получили очередной элемент, Ложь - нет)"
	ИначеЕсли ОпКод = 16 Тогда // "Операция = (присвоение)"    
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		УстановитьЗначениеПамяти(ЗначениеСтекаН, ЗначениеСтекаВ.Значение.Получить()); 
		
		//ТекстМодуля(1, Константы.ТекущаяСтрока.Получить());
		
		Константы.ТекущаяСтрока.Установить(Константы.ТекущаяСтрока.Получить() + 1);
		
	ИначеЕсли ОпКод = 17 Тогда // "Возврат (установить результат функции/метода)"		
	ИначеЕсли ОпКод = 18 Тогда // "Указание количества используемых параметров в следующем вызове (метода, функции)"
		
		ДобавитьВСтек(, Операнд,,,,, Шаг); 
		
	ИначеЕсли ОпКод = 19 Тогда // "Вызов локальной процедуры или функции"
		
		//АдресФункцииПроцедуры =  Stack.Получить(Stack.Количество() - 1).Значение;
		//КоличествоПеременных = Stack.Получить(Stack.Количество() - 2).Значение; 
		//
		//Переменные = Новый Массив;
		//
		//Если КоличествоПеременных > 0 Тогда 
		//	
		//	Для А = 1 По Переменные Цикл 
		//		
		//		Переменные.Добавить(Stack.Получить(Stack.Количество() - 2 - А).Значение); 
		//		
		//	КонецЦикла;
		//	
		//КонецЕсли;
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//Если КоличествоПеременных > 0 Тогда 
		//	
		//	Для А = 1 По Переменные Цикл 
		//		
		//		Stack.Удалить(Stack.Количество() - 1);
		//		
		//	КонецЦикла;
		//	
		//КонецЕсли;
		
	ИначеЕсли ОпКод = 20 Тогда // "Выполнение метода .<Имя метода>() (являющегося процедурой, т.е. без возврата значения)"  
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(ПолучитьРазмерСтека());    
		
		Для А = 1 По ЗначениеСтекаВ.Значение.Получить() Цикл 
			
			УдалитьЗначениеСтека(ПолучитьРазмерСтека());    
			
		КонецЦикла;
		
	ИначеЕсли ОпКод = 21 Тогда // "Выполнение метода .<Имя метода>() (являющегося функцией, т.е. возвращающий значение)"
		
		Метод = ПолучитьЗначениеКонстантыПоНомеру(Операнд + 1);
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(ПолучитьРазмерСтека());   
		
		УдалитьЗначениеСтека(ПолучитьРазмерСтека());  
		
		Массив = Новый Массив;
		
		Для А = 1 По ЗначениеСтекаВ.Значение.Получить() Цикл  
			
			Массив.Добавить(ПолучитьЗначениеСтекаПоИндексу(ПолучитьРазмерСтека()).Значение.Получить());
			
			УдалитьЗначениеСтека(ПолучитьРазмерСтека());    
			
		КонецЦикла;
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(ПолучитьРазмерСтека());   
		
		УдалитьЗначениеСтека(ПолучитьРазмерСтека()); 
		
		Параметры = "";
		
		Если Массив.Количество() > 0 Тогда
			
			Для А = 0 По Массив.Количество() - 1  Цикл 
				
				Параметры = Параметры + "Массив[" + А + "],";
				
			КонецЦикла;  
			
			Параметры = Лев(Параметры, СтрДлина(Параметры) - 1);
			
		КонецЕсли;
		
		Object = Неопределено;   
		
		Выполнить("Object = ЗначениеСтекаН.Значение.Получить(). " + Метод + "(" + Параметры + ");");
		
		ДобавитьВСтек(, Object,,,,, Шаг);  
		
	ИначеЕсли ОпКод = 22 Тогда // "Конец блока (процедуры, модуля)" 
		
		ЗафиксироватьТранзакцию();
		
		Возврат Новый Структура("Результат, Шаг", Ложь, -1);
		
	ИначеЕсли ОпКод = 23 Тогда // "Операция - "   
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УстановитьЗначениеПамяти(ЗначениеСтекаВ, ЗначениеСтекаВ.Значение.Получить() * (-1));
		
	ИначеЕсли ОпКод = 24 Тогда // "Операция +" 
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УстановитьЗначениеПамяти(ЗначениеСтекаН, ЗначениеСтекаВ.Значение.Получить() + ЗначениеСтекаН.Значение.Получить());
		
	ИначеЕсли ОпКод = 25 Тогда // "Операция -"  
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УстановитьЗначениеПамяти(ЗначениеСтекаН, ЗначениеСтекаВ.Значение.Получить() - ЗначениеСтекаН.Значение.Получить());
		
	ИначеЕсли ОпКод = 26 Тогда // "Операция *"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УстановитьЗначениеПамяти(ЗначениеСтекаН, ЗначениеСтекаВ.Значение.Получить() * ЗначениеСтекаН.Значение.Получить());
		
	ИначеЕсли ОпКод = 27 Тогда // "Операция /"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УстановитьЗначениеПамяти(ЗначениеСтекаН, ЗначениеСтекаВ.Значение.Получить() / ЗначениеСтекаН.Значение.Получить());
		
	ИначеЕсли ОпКод = 28 Тогда // "Операция %"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УстановитьЗначениеПамяти(ЗначениеСтекаН, ЗначениеСтекаВ.Значение.Получить() % ЗначениеСтекаН.Значение.Получить());
		
	ИначеЕсли ОпКод = 29 Тогда // "Операция НЕ"
	ИначеЕсли ОпКод = 30 Тогда // "Операция И. Если операнд на вершине стека Ложь, то происходит переход по адресу, указаному во втором параметре, т.е. пропуск вычисления второго операнда, т.к. от него уже ничего не зависит. Из стека при этом значение не удаляется (результатом операции является Ложь). Иначе, если на вершине стека Истина, из стека удаляется значение и перехода не происходит, т.е. вычисляется второй операнд, результат которого полностью определяет результат всей операции)"
	ИначеЕсли ОпКод = 31 Тогда // "Операция ИЛИ. Если операнд на вершине стека Истина, то происходит переход по адресу, указаному во втором параметре, т.е. пропуск вычисления второго операнда, т.к. от него уже ничего не зависит. Из стека при этом значение не удаляется (результатом операции является Истина). Иначе, если на вершине стека Ложь, из стека удаляется значение и перехода не происходит, т.е. вычисляется второй операнд, результат которого полностью определяет результат всей операции)"
	ИначеЕсли ОпКод = 32 Тогда // "unknown2"
	ИначеЕсли ОпКод = 33 Тогда // "Операция = (сравнение)"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		ДобавитьВСтек(, ЗначениеСтекаВ.Значение.Получить() = ЗначениеСтекаН.Значение.Получить(),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 34 Тогда // "Операция <>"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		ДобавитьВСтек(, ЗначениеСтекаВ.Значение.Получить() <> ЗначениеСтекаН.Значение.Получить(),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 35 Тогда // "Операция >"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		ДобавитьВСтек(, ЗначениеСтекаВ.Значение.Получить() > ЗначениеСтекаН.Значение.Получить(),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 36 Тогда // "Операция <"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		ДобавитьВСтек(, ЗначениеСтекаВ.Значение.Получить() < ЗначениеСтекаН.Значение.Получить(),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 37 Тогда // "Операция >="
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		ДобавитьВСтек(, ЗначениеСтекаВ.Значение.Получить() >= ЗначениеСтекаН.Значение.Получить(),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 38 Тогда // "Операция <="
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		ДобавитьВСтек(, ЗначениеСтекаВ.Значение.Получить() <= ЗначениеСтекаН.Значение.Получить(),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 39 Тогда // "Переход на заданный шаг"
		
		ЗафиксироватьТранзакцию();
		
		Возврат Новый Структура("Результат, Шаг", Истина, Операнд + 1);
		
	ИначеЕсли ОпКод = 40 Тогда // "Переход, если Ложь"  
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		Если ЗначениеСтекаВ.Значение.Получить() = Ложь Тогда
			
			ЗафиксироватьТранзакцию();
			
			Возврат Новый Структура("Результат, Шаг", Истина, Операнд + 1);
			
		КонецЕсли;
		
	ИначеЕсли ОпКод = 41 Тогда // "Переход, если Истина"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);   
		
		Если ЗначениеСтекаВ.Значение.Получить() = Истина Тогда
			
			ЗафиксироватьТранзакцию();
			
			Возврат Новый Структура("Результат, Шаг", Истина, Операнд + 1);
			
		КонецЕсли;
		
	ИначеЕсли ОпКод = 42 Тогда // "Перейти"  
		
		ЗафиксироватьТранзакцию();
		
		Возврат Новый Структура("Результат, Шаг", Истина, ПолучитьАдресМетки(Операнд + 1, Перечисления.ТипМетки.Глобальная) + 1);
		
	ИначеЕсли ОпКод = 43 Тогда // "Инкремент"   
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);  
		
		УдалитьЗначениеСтека(Размер);   
		
		Memory = РегистрыСведений.Memory.СоздатьМенеджерЗаписи();
		
		Значение = ЗначениеСтекаВ.Значение.Получить() + 1;
		
		ЗаполнитьЗначенияСвойств(Memory, ЗначениеСтекаВ);   
		
		Memory.Строка = 0;                                   
		
		Memory.Значение = Новый ХранилищеЗначения(Значение); 
		
		Memory.Записать(Истина);  
		
	ИначеЕсли ОпКод = 44 Тогда // "Попытка"
	ИначеЕсли ОпКод = 45 Тогда // "Завершение блока (Процедура, Функция, Попытка) без ошибки (Возврат или Исключение)"
		
		//PROC.Удалить(PROC.Количество() - 1);
		
		//ВывестиТекстМодуля("КонецФункции", Ложь);
		
	ИначеЕсли ОпКод = 46 Тогда // "КонецПопытки (конец обработки ошибки)"
	ИначеЕсли ОпКод = 47 Тогда // "ВызватьИсключение"
	ИначеЕсли ОпКод = 48 Тогда // "Создать на стеке временных переменных временную переменную"    
		
		ДобавитьВСтекTMP();
		
	ИначеЕсли ОпКод = 49 Тогда // "Загрузить в стек временную переменную из стека временных переменных"
		
		ЗначениеСтекаTMP = ПолучитьЗначениеСтекаTMPПоИндексу(ПолучитьРазмерСтекаTMP());   
		
		//УдалитьЗначениеСтекаTMP(ПолучитьРазмерСтекаTMP()); 
		
		ДобавитьВСтек(ЗначениеСтекаTMP.Адрес, ЗначениеСтекаTMP,, ЗначениеСтекаTMP.Тип, Истина,, Шаг);  
		
	ИначеЕсли ОпКод = 50 Тогда // "Удалить из стека временных переменных временную переменную"
		
		УдалитьЗначениеСтекаTMP(ПолучитьРазмерСтекаTMP()); 
		
	ИначеЕсли ОпКод = 51 Тогда // "Новый"
		
		Object = Неопределено;
		
		НовыйОбъект = ПолучитьЗначениеКонстантыПоНомеру(Операнд + 1);   
		
		Размер = ПолучитьРазмерСтека(); 
		
		КоличествоАргументов = ПолучитьЗначениеСтекаПоИндексу(Размер).Значение.Получить();   
		
		УдалитьЗначениеСтека(Размер); 
		
		Аргументы = "";
		
		Если КоличествоАргументов > 0 Тогда 
			
			Размер = ПолучитьРазмерСтека(); 
			
			Для А = 1 По КоличествоАргументов Цикл  
				
				Размер = ПолучитьРазмерСтека(); 
				
				Аргументы = Аргументы + Строка(ПолучитьЗначениеСтекаПоИндексу(Размер).Значение.Получить()) + ",";
				
				УдалитьЗначениеСтека(Размер); 
				
			КонецЦикла;
			
			Аргументы = Лев(Аргументы, СтрДлина(Аргументы) - 1);
			
		КонецЕсли;
		
		Выполнить("Object = Новый " + НовыйОбъект + "(" + Аргументы + ");");
		
		ДобавитьВСтек(, Object,,,,, Шаг);  
		
	ИначеЕсли ОпКод = 52 Тогда // "Выполнить"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер); 
		
		//Выполнить(ЗначениеСтека.Значение);
		
	ИначеЕсли ОпКод = 53 Тогда // "СтрДлина"  
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, СтрДлина(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 54 Тогда // "СокрЛ"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, СокрЛ(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 55 Тогда // "СокрП"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, СокрП(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 56 Тогда // "СокрЛП"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, СокрЛП(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 57 Тогда // "Лев" 
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, НижнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Лев(ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 58 Тогда // "Прав"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, НижнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Прав(ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 59 Тогда // "Сред"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//ВерхнийАдрес1 = Stack.Получить(Stack.Количество() - 3);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение1 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес1.Адрес, НижнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Сред(ВерхнееЗначение1, ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 60 Тогда // "Найти" 
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, НижнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Найти(ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 61 Тогда // "Врег"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Врег(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 62 Тогда // "Нрег"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Нрег(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 63 Тогда // "Символ"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Символ(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 64 Тогда // "КодСимвола"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаВ = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтекаН = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КодСимвола(ЗначениеСтекаН.Значение.Получить(), ЗначениеСтекаВ.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 65 Тогда // "ПустаяСтрока"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ПустаяСтрока(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 66 Тогда // "Цел"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Цел(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 67 Тогда // "Окр"    
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Окр(ВерхнееЗначение, НижнееЗначение));  
		
	ИначеЕсли ОпКод = 68 Тогда // "Окр"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//ВерхнийАдрес1 = Stack.Получить(Stack.Количество() - 3);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//ВерхнееЗначение1 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес1.Адрес, ВерхнийАдрес1);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Окр(ВерхнееЗначение1, ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 69 Тогда // "Булево"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Булево(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 70 Тогда // "Число"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Число(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 71 Тогда // "Строка"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Строка(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 72 Тогда // "Дата"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Дата(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 73 Тогда // "Дата"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//ВерхнийАдрес1 = Stack.Получить(Stack.Количество() - 3);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//ВерхнееЗначение1 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес1.Адрес, ВерхнийАдрес1);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Дата(ВерхнееЗначение1, ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 74 Тогда // "Дата"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//ВерхнийАдрес1 = Stack.Получить(Stack.Количество() - 3);  
		//ВерхнийАдрес2 = Stack.Получить(Stack.Количество() - 4);  
		//ВерхнийАдрес3 = Stack.Получить(Stack.Количество() - 5);  
		//ВерхнийАдрес4 = Stack.Получить(Stack.Количество() - 6);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//ВерхнееЗначение1 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес1.Адрес, ВерхнийАдрес1);
		//ВерхнееЗначение2 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес2.Адрес, ВерхнийАдрес2);
		//ВерхнееЗначение3 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес3.Адрес, ВерхнийАдрес3);
		//ВерхнееЗначение4 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес4.Адрес, ВерхнийАдрес4);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Дата(ВерхнееЗначение4, ВерхнееЗначение3, ВерхнееЗначение2, ВерхнееЗначение1, ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 75 Тогда // "ДобавитьМесяц"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, ДобавитьМесяц(ВерхнееЗначение, НижнееЗначение));  
		
	ИначеЕсли ОпКод = 76 Тогда // "НачалоМесяца"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НачалоМесяца(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 77 Тогда // "КонецМесяца"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КонецМесяца(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 78 Тогда // "НачалоКвартала"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НачалоКвартала(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 79 Тогда // "КонецКвартала"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КонецКвартала(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 80 Тогда // "НачалоГода"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НачалоГода(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 81 Тогда // "КонецГода"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КонецГода(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 82 Тогда // "Год"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Год(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 83 Тогда // "Месяц"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Месяц(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 84 Тогда // "День"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, День(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 85 Тогда // "Час"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Час(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 86 Тогда // "Минута"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Минута(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 87 Тогда // "Секунда"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Секунда(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 88 Тогда // "ДеньГода"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ДеньГода(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 89 Тогда // "НеделяГода"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НеделяГода(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 90 Тогда // "ДеньНедели"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ДеньНедели(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 91 Тогда // "НачалоНедели"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НачалоНедели(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 92 Тогда // "КонецНедели"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КонецНедели(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 93 Тогда // "НачалоДня"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НачалоДня(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 94 Тогда // "КонецДня"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КонецДня(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 95 Тогда // "НачалоЧаса"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НачалоЧаса(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 96 Тогда // "КонецЧаса"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КонецЧаса(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 97 Тогда // "НачалоМинуты"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, НачалоМинуты(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 98 Тогда // "КонецМинуты"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, КонецМинуты(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 99 Тогда // "ТекущаяДата"    
		
		ДобавитьВСтек(, ТекущаяДата());
		
	ИначеЕсли ОпКод = 100 Тогда // "СтрЗаменить"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//ВерхнийАдрес1 = Stack.Получить(Stack.Количество() - 3);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//ВерхнееЗначение1 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес1.Адрес, ВерхнийАдрес1);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, СтрЗаменить(ВерхнееЗначение1, ВерхнееЗначение, НижнееЗначение));
		
	ИначеЕсли ОпКод = 101 Тогда // "СтрЧислоСтрок"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, СтрЧислоСтрок(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 102 Тогда // "СтрПолучитьСтроку"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, СтрПолучитьСтроку(ВерхнееЗначение, НижнееЗначение));  
		
	ИначеЕсли ОпКод = 103 Тогда // "Мин"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Мин(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 104 Тогда // "Макс"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Макс(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 105 Тогда // "СтрЧислоВхождений"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, СтрЧислоВхождений(ВерхнееЗначение, НижнееЗначение));  
		
	ИначеЕсли ОпКод = 106 Тогда // "ОписаниеОшибки"
		
		ДобавитьВСтек(, ОписаниеОшибки(),,,,, Шаг);
		
	ИначеЕсли ОпКод = 107 Тогда // "ТипЗнч"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ТипЗнч(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 108 Тогда // "Тип"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Тип(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 109 Тогда // "Вычислить"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Вычислить(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 110 Тогда // "Формат"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Формат(ВерхнееЗначение, НижнееЗначение));  
		
	ИначеЕсли ОпКод = 111 Тогда // "Новый"
	ИначеЕсли ОпКод = 112 Тогда // "ACos"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ACos(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 113 Тогда // "ASin"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ASin(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 114 Тогда // "ATan"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ATan(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 115 Тогда // "Cos"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Cos(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 116 Тогда // "Exp"     
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Exp(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 117 Тогда // "Log"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Log(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 118 Тогда // "Log10"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Log10(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 119 Тогда // "Pow"
		
		//НижнийАдрес	 = Stack.Получить(Stack.Количество() - 1);
		//ВерхнийАдрес = Stack.Получить(Stack.Количество() - 2);  
		//
		//НижнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(НижнийАдрес.Адрес, НижнийАдрес);
		//ВерхнееЗначение	 = ПолучитьЗначениеПамятиПоАдресу(ВерхнийАдрес.Адрес, ВерхнийАдрес);
		//
		//Stack.Удалить(Stack.Количество() - 1);
		//Stack.Удалить(Stack.Количество() - 1);
		//
		//ДобавитьВСтек(, Pow(ВерхнееЗначение, НижнееЗначение));  
		
	ИначеЕсли ОпКод = 120 Тогда // "Sin"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Sin(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 121 Тогда // "Sqrt"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Sqrt(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 122 Тогда // "Tan"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, Tan(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 123 Тогда // "ДобавитьОбработчик"
	ИначеЕсли ОпКод = 124 Тогда // "ДобавитьОбработчик"
	ИначеЕсли ОпКод = 125 Тогда // "УдалитьОбработчик"
	ИначеЕсли ОпКод = 126 Тогда // "УдалитьОбработчик"
	ИначеЕсли ОпКод = 127 Тогда // "ТРег"
		
		Размер = ПолучитьРазмерСтека(); 
		
		ЗначениеСтека = ПолучитьЗначениеСтекаПоИндексу(Размер);   
		
		УдалитьЗначениеСтека(Размер);
		
		ДобавитьВСтек(, ТРег(ЗначениеСтека.Значение.Получить()),,,,, Шаг);  
		
	ИначеЕсли ОпКод = 128 Тогда // "ИнформацияОбОшибке"
		
		ДобавитьВСтек(, ИнформацияОбОшибке(),,,,, Шаг);
		
	КонецЕсли;  
	
	ЗафиксироватьТранзакцию();
	
	Возврат Новый Структура("Результат, Шаг", Истина, Шаг + 1);    
	
КонецФункции
//*****************************************************************************************   