//****************************************************************************************
&НаСервере
Процедура Команда1НаСервере()  
	
	Объект.Результат = "";
	
	Массив = СтрРазделить(Объект.ВходящиеДанные, ";");
	
	Для Каждого Строка Из Массив Цикл
		
		Объект.Результат = Объект.Результат + СокрЛП(Строка) + ";" + Символы.ПС; 
		
	КонецЦикла;
	
КонецПроцедуры
//****************************************************************************************
&НаКлиенте
Процедура Команда1(Команда) 
	
	Команда1НаСервере();

КонецПроцедуры
//****************************************************************************************
