//*****************************************************************************************
&НаСервере
Процедура ОчиститьНаСервере()

	Memory = РегистрыСведений.Memory.СоздатьНаборЗаписей();
	
	Memory.Записать();

КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура Очистить(Команда)  
	
	ОчиститьНаСервере(); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
//*****************************************************************************************
