//*****************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Stack.Значение КАК Значение,
	|	Stack.Отладка КАК Отладка
	|ИЗ
	|	РегистрСведений.Stack КАК Stack
	|ГДЕ
	|	Stack.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Запись.Адрес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Попытка 
			
			ПредставлениеЗначения = Строка(Выборка.Значение.Получить());
			
		Исключение
			
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры
//*****************************************************************************************