//*****************************************************************************************
&НаСервере
Процедура ОчиститьНаСервере()

	CodeText = РегистрыСведений.CodeText.СоздатьНаборЗаписей();
	
	CodeText.Записать();

КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура Очистить(Команда)
	
	ОчиститьНаСервере(); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
//*****************************************************************************************
