//*****************************************************************************************
&НаСервере
Процедура ОчиститьНаСервере()

	Stack = РегистрыСведений.StackTMP.СоздатьНаборЗаписей();
	
	Stack.Записать();

КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура Очистить(Команда)  
	
	ОчиститьНаСервере();    
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
//*****************************************************************************************
