//*****************************************************************************************
&НаСервере
Процедура ОчиститьНаСервере()

	Code = РегистрыСведений.Code.СоздатьНаборЗаписей();
	
	Code.Записать();

КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура Очистить(Команда)
	
	ОчиститьНаСервере(); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
//*****************************************************************************************
