//*****************************************************************************************
&НаСервере
Процедура ОчиститьНаСервере()

	History = РегистрыСведений.History.СоздатьНаборЗаписей();
	
	History.Записать();

КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура Очистить(Команда)    
	
	ОчиститьНаСервере();    
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
//*****************************************************************************************
