//*****************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Значение КАК Значение,
	|	Memory.Отладка КАК Отладка
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Запись.Адрес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Попытка 
			
			ПредставлениеЗначения = Строка(Выборка.Значение.Получить());
			
		Исключение
			
		КонецПопытки; 
		
		Попытка 
			
			ПредставлениеОтладки = Строка(Выборка.Отладка.Получить());
			
		Исключение
			
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры
//*****************************************************************************************
&НаСервере
Процедура ЗначениеОтладкиПриИзмененииНаСервере()   
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Адрес КАК Адрес,
	|	Memory.Наименование КАК Наименование,
	|	Memory.Значение КАК Значение,
	|	Memory.Отладка КАК Отладка,
	|	Memory.Тип КАК Тип,
	|	Memory.Строка КАК Строка
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Запись.Адрес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Memory = РегистрыСведений.Memory.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Memory, Выборка);
		
		Memory.Отладка = Новый ХранилищеЗначения(ЗначениеОтладки);
		
		Memory.Записать();
		
	КонецЕсли; 
	
КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура ЗначениеОтладкиПриИзменении(Элемент) 
	
	ЗначениеОтладкиПриИзмененииНаСервере(); 
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры
//*****************************************************************************************
