//*****************************************************************************************  
&НаСервере
Функция ПолучитьТекстМакета()

	Возврат ПолучитьОбщийМакет("HTML").ПолучитьТекст();

КонецФункции
//*****************************************************************************************  
&НаСервере
Функция ПолучитьОформлениеКода()

	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("(", "<span class=""red"">(</span>");
	Соответствие.Вставить(")", "<span class=""red"">)</span>");
	Соответствие.Вставить(".", "<span class=""red"">.</span>");
	Соответствие.Вставить(",", "<span class=""red"">,</span>");
	Соответствие.Вставить(";", "<span class=""red"">;</span>");
	Соответствие.Вставить("Истина", "<span class=""red"">Истина</span>");
	Соответствие.Вставить("И", "<span class=""red"">И</span>");
	Соответствие.Вставить("КонецЕсли", "<span class=""red"">КонецЕсли</span>");
	Соответствие.Вставить("Если", "<span class=""red"">Если</span>");
	Соответствие.Вставить("Тогда", "<span class=""red"">Тогда</span>");
	Соответствие.Вставить("Функция", "<span class=""red"">Функция</span>");
	Соответствие.Вставить("КонецФункции", "<span class=""red"">КонецФункции</span>");
	Соответствие.Вставить("Процедура", "<span class=""red"">Процедура</span>");
	Соответствие.Вставить("КонецПроцедуры", "<span class=""red"">КонецПроцедуры</span>");
	Соответствие.Вставить("Цикл", "<span class=""red"">Цикл</span>");
	Соответствие.Вставить("По", "<span class=""red"">По</span>");
	Соответствие.Вставить("Для", "<span class=""red"">Для</span>");
	Соответствие.Вставить("Каждого", "<span class=""red"">Каждого</span>");
	Соответствие.Вставить("Из", "<span class=""red"">Из</span>");
	Соответствие.Вставить("Пока", "<span class=""red"">Пока</span>");
	Соответствие.Вставить("Перейти", "<span class=""red"">Перейти</span>");
	Соответствие.Вставить("Новый", "<span class=""red"">Новый</span>");
	Соответствие.Вставить("Ложь", "<span class=""red"">Ложь</span>");
	Соответствие.Вставить("==", "<span class=""black"">=</span>");
	Соответствие.Вставить("~", "<span class=""black"">~</span>");
	Соответствие.Вставить("&gt;", "<span class=""black"">&gt;</span>");
	Соответствие.Вставить("&lt;", "<span class=""black"">&lt;</span>");
	Соответствие.Вставить("&gt;=", "<span class=""black"">&gt;=</span>");
	Соответствие.Вставить("&lt;=", "<span class=""black"">&lt;=</span>");
	Соответствие.Вставить("НЕ", "<span class=""red"">НЕ</span>");
	Соответствие.Вставить("ИЛИ", "<span class=""red"">ИЛИ</span>");
	
	Возврат Соответствие;

КонецФункции
//*****************************************************************************************  
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Оформление = ПолучитьОформлениеКода();  
	
	Текст = "";
	
	Для А = 1 По СтрЧислоСтрок(Параметры.text) Цикл
		
		Строка = СокрЛП(СтрПолучитьСтроку(Параметры.text, А));
		
		Строка = СтрЗаменить(Строка, "=", "=="); 
		Строка = СтрЗаменить(Строка, "<", "&gt;"); 
		Строка = СтрЗаменить(Строка, ">", "&lt;"); 

		Для Каждого Элемент Из Оформление Цикл
			
			Строка = СтрЗаменить(Строка, Элемент.Ключ, Элемент.Значение); 

		КонецЦикла;  
		
		Текст = Текст + Строка + "</br>";
	
	КонецЦикла;     

	HTML = СтрЗаменить(ПолучитьТекстМакета(), "%TEXT%", Текст);

КонецПроцедуры
//*****************************************************************************************  
