//******************************************************************************
&НаКлиенте
Процедура Команда1(Команда) 
	
	Количество = 1;
	
	Пока Истина Цикл 
		
		Результат = ""; 
		
		Попытка
			
			Для А = 1 По Количество Цикл 
				
				ПервоеЧисло = Число(Сред(Объект.Стр1,(А - 1) * 4 + 1, 4));
				ВтороеЧисло = Число(Символ(КодСимвола(Объект.Стр2, А)));
				
				Результат = Результат + Символ(ПервоеЧисло - ВтороеЧисло);
				
			КонецЦикла;
			
			Количество = Количество + 1;
			
		Исключение
			
			Прервать;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Объект.Стр3 = Результат; 
	
КонецПроцедуры
//******************************************************************************