//******************************************************************************
Функция РасшифроватьСтроку_Нетленка(ПерваяСтрока, ВтораяСтрока) Экспорт  
	
	Количество = 1;

	Результат = ""; 

	Пока Истина Цикл 
		
		Результат = ""; 
		
		Попытка
			
			Для А = 1 По Количество Цикл 
				
				ПервоеЧисло = Число(Сред(ПерваяСтрока, (А - 1) * 4 + 1, 4));
				ВтороеЧисло = Число(Символ(КодСимвола(ВтораяСтрока, А)));
				
				Результат = Результат + Символ(ПервоеЧисло - ВтороеЧисло);
				
			КонецЦикла;
			
			Количество = Количество + 1;
			
		Исключение
			
			Прервать;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции
//******************************************************************************