//*****************************************************************************************
&НаСервере
Процедура ОчиститьНаСервере()

	Значения = РегистрыСведений.ПроцедурыФункции.СоздатьНаборЗаписей();
	
	Значения.Записать();

КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура Очистить(Команда) 
	
	ОчиститьНаСервере(); 
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
//*****************************************************************************************
