//***********************************************************************************************************
&НаКлиенте
Процедура Деобфускация(Команда)
	
	Перем Переменная;
	
	Замена = "";

	Строки = Новый Массив();

	Массив = СтрРазделить(Объект.Данные, ";");
	
	//Если СтрНайти(Массив[0], "var") > 0 Тогда

	//	Замена = СокрЛП(Сред(Массив[0], 4));
	//	
	//	Массив[0] = "";
	//		
	//КонецЕсли;
	
	Для А = 0 По Массив.Количество() - 1 Цикл
		
		ТекущаяСтрока = Массив[А];
		
	//	Если СтрДлина(ТекущаяСтрока) = 0 Тогда
	//		
	//		Массив[А] = "Строки.Добавить(""" + Строка(А) + """);";
	//		
	//		Продолжить;
	//
	//	КонецЕсли;	

	//	Если       
	//		СтрНайти(ТекущаяСтрока, "Переменная") = 0 И
	//		СтрНайти(ТекущаяСтрока, "<=") = 0 И
	//		СтрНайти(ТекущаяСтрока, "<>") = 0 И
	//		СтрНайти(ТекущаяСтрока, ">=") = 0 И
	//		СтрНайти(ТекущаяСтрока, "b__") = 0 И
	//		СтрНайти(ТекущаяСтрока, "_0=_1") = 0 И
	//		СтрНайти(ТекущаяСтрока, "_0=-_0") = 0 И
	//		СтрНайти(ТекущаяСтрока, "_1=0") = 0 И
	//		СтрНайти(ТекущаяСтрока, "_1=1") = 0 И
	//		СтрНайти(ТекущаяСтрока, "_1=-_1") = 0 И
	//		СтрНайти(ТекущаяСтрока, "_0=1") = 0 И
	//		СтрНайти(ТекущаяСтрока, "_1=1") = 0 И 		
	//		СтрНайти(ТекущаяСтрока, "=_0") = 0 И 		
	//		СтрНайти(ТекущаяСтрока, "Неопределено") = 0 И
	//		СтрНайти(ТекущаяСтрока, "goto") = 0 И
	//		СтрНайти(ТекущаяСтрока, "if") = 0 И
	//		СтрНайти(ТекущаяСтрока, "endtry") = 0 И
	//		СтрНайти(ТекущаяСтрока, "try") = 0 И
	//		СтрНайти(ТекущаяСтрока, "except") = 0 И    
	//		СтрНайти(ТекущаяСтрока, "конеццикла") = 0 И
	//		СтрНайти(ТекущаяСтрока, "для") = 0 Тогда
	//		
	//		Если СтрНайти(ТекущаяСтрока, "=") > 0 Тогда
	//			
	//			ЗнакРавно = СтрНайти(ТекущаяСтрока, "=");
	//			
	//			Значение = Сред(ТекущаяСтрока, ЗнакРавно + 1); 
	//			
	//			Операнд = Лев(ТекущаяСтрока, ЗнакРавно - 1); 
	//			
	//			ТекущаяСтрока = Операнд + "=""" + Значение + """";
	//			
	//		Иначе
	//			
	//			Если СтрНайти(ТекущаяСтрока, "~") = 0 Тогда 
	//			
	//				ТекущаяСтрока = Символы.ПС + "ВременнаяПеременная" + "=""" + СокрЛП(ТекущаяСтрока) + """";
	//			
	//			КонецЕсли;
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
		
		ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока, Замена, "Переменная");

		Массив[А] = ТекущаяСтрока + "; Строки.Добавить(""" + Строка(А) + """);";
		
	КонецЦикла;
	
	Текст = "";
	
	Для А = 0 По Массив.Количество() - 1 Цикл
		
		Текст = Текст + Массив[А];
		
	КонецЦикла;
	
	Объект.Результат = Текст;
	
	//Выполнить(Текст);
	//
	//МассивКода = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.Данные, ";");
	//
	//Объект.Результат = "";
	//
	//Для А = 0 По Строки.Количество() - 1 Цикл
	//	
	//	ТекущаяСтрока = МассивКода[Число(Строки[А])];
	//	
	//	Если СтрДлина(ТекущаяСтрока) = 0 Тогда
	//		
	//		Продолжить;
	//		
	//	КонецЕсли;
	//	
	//	//Если СтрНайти(ТекущаяСтрока, "_0") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_1") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_2") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_3") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_4") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_5") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_6") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_7") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "_8") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "if") > 0 
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "var") > 0
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "endtry") > 0
	//	//	ИЛИ СтрНайти(ТекущаяСтрока, "~") > 0 Тогда
	//	//	
	//	//	Если СтрДлина(СокрЛП(ТекущаяСтрока)) <= 9
	//	//		ИЛИ СтрНайти(ТекущаяСтрока, "if") > 0
	//	//		ИЛИ СтрНайти(ТекущаяСтрока, "var") > 0 Тогда
	//	//	
	//	//		Продолжить;
	//	//	
	//	//	КонецЕсли;
	//	//	
	//	//КонецЕсли;
	//	
	//	Объект.Результат = Объект.Результат + СокрЛП(ТекущаяСтрока) + ";" + Символы.ПС;
	//	
	//КонецЦикла;

КонецПроцедуры
//***********************************************************************************************************
